#### Terraform Initialization ⚙️`success`
#### Terraform Format  🖌`success`
#### Terraform Validation 🤖`success`
#### Terraform Infratest 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan Changes</summary>

```

terraform
aws_subnet.my_subnet: Refreshing state... [id=subnet-0c65e9f2cf4be380a]
aws_network_interface.eni: Refreshing state... [id=eni-035256a88caa195e8]
aws_s3_bucket.flugel_s3: Refreshing state... [id=bashox1234567890]
aws_vpc.my_vpc: Refreshing state... [id=vpc-0da1a7f6a9bbc1965]
aws_instance.flugel_instance: Refreshing state... [id=i-03db5de0b881153c2]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.flugel_instance has been deleted
  - resource "aws_instance" "flugel_instance" {
      - ami                                  = "ami-04505e74c0741db8d" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:438764419550:instance/i-03db5de0b881153c2" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-03db5de0b881153c2" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-035256a88caa195e8" -> null
      - private_dns                          = "ip-10-0-1-204.ec2.internal" -> null
      - private_ip                           = "10.0.1.204" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0c65e9f2cf4be380a" -> null
      - tags                                 = {
          - "Name"  = "Flugel"
          - "Owner" = "InfraTeam"
        } -> null
      - tags_all                             = {
          - "Name"  = "Flugel"
          - "Owner" = "InfraTeam"
        } -> null
      - tenancy                              = "default" -> null
      - vpc_security_group_ids               = [
          - "sg-069217f86618e50af",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - network_interface {
          - delete_on_termination = false -> null
          - device_index          = 0 -> null
          - network_interface_id  = "eni-035256a88caa195e8" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-079720ea63109db1f" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_network_interface.eni has been deleted
  - resource "aws_network_interface" "eni" {
      - arn                       = "arn:aws:ec2:us-east-1:438764419550:network-interface/eni-035256a88caa195e8" -> null
      - id                        = "eni-035256a88caa195e8" -> null
      - interface_type            = "interface" -> null
      - ipv4_prefix_count         = 0 -> null
      - ipv4_prefixes             = [] -> null
      - ipv6_address_count        = 0 -> null
      - ipv6_address_list         = [] -> null
      - ipv6_address_list_enabled = false -> null
      - ipv6_addresses            = [] -> null
      - ipv6_prefix_count         = 0 -> null
      - ipv6_prefixes             = [] -> null
      - mac_address               = "12:5c:fd:8a:e2:a5" -> null
      - owner_id                  = "438764419550" -> null
      - private_ip                = "10.0.1.204" -> null
      - private_ip_list           = [
          - "10.0.1.204",
        ] -> null
      - private_ip_list_enabled   = false -> null
      - private_ips               = [
          - "10.0.1.204",
        ] -> null
      - private_ips_count         = 0 -> null
      - security_groups           = [
          - "sg-069217f86618e50af",
        ] -> null
      - source_dest_check         = true -> null
      - subnet_id                 = "subnet-0c65e9f2cf4be380a" -> null
      - tags                      = {
          - "Name" = "primary_network_interface"
        } -> null
      - tags_all                  = {
          - "Name" = "primary_network_interface"
        } -> null
    }

  # aws_s3_bucket.flugel_s3 has been deleted
  - resource "aws_s3_bucket" "flugel_s3" {
      - acl                                  = "private" -> null
      - arn                                  = "arn:aws:s3:::bashox1234567890" -> null
      - bucket                               = "bashox1234567890" -> null
      - bucket_domain_name                   = "bashox1234567890.s3.amazonaws.com" -> null
      - bucket_regional_domain_name          = "bashox1234567890.s3.amazonaws.com" -> null
      - cors_rule                            = [] -> null
      - force_destroy                        = false -> null
      - grant                                = [] -> null
      - hosted_zone_id                       = "Z3AQBSTGFYJSTF" -> null
      - id                                   = "bashox1234567890" -> null
      - lifecycle_rule                       = [] -> null
      - logging                              = [] -> null
      - region                               = "us-east-1" -> null
      - replication_configuration            = [] -> null
      - request_payer                        = "BucketOwner" -> null
      - server_side_encryption_configuration = [] -> null
      - tags                                 = {
          - "Name"  = "Flugel"
          - "Owner" = "InfraTeam"
        } -> null
      - tags_all                             = {
          - "Name"  = "Flugel"
          - "Owner" = "InfraTeam"
        } -> null
      - versioning                           = [
          - {
              - enabled    = false
              - mfa_delete = false
            },
        ] -> null
      - website                              = [] -> null
    }

  # aws_subnet.my_subnet has been deleted
  - resource "aws_subnet" "my_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:438764419550:subnet/subnet-0c65e9f2cf4be380a" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0c65e9f2cf4be380a" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "438764419550" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "subnet"
        } -> null
      - tags_all                                       = {
          - "Name" = "subnet"
        } -> null
      - vpc_id                                         = "vpc-0da1a7f6a9bbc1965" -> null
    }

  # aws_vpc.my_vpc has been deleted
  - resource "aws_vpc" "my_vpc" {
      - arn                              = "arn:aws:ec2:us-east-1:438764419550:vpc/vpc-0da1a7f6a9bbc1965" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.0.0.0/16" -> null
      - default_network_acl_id           = "acl-07ce22f638fc9f8c0" -> null
      - default_route_table_id           = "rtb-04d935b71a58b78f9" -> null
      - default_security_group_id        = "sg-069217f86618e50af" -> null
      - dhcp_options_id                  = "dopt-0cc19e0c486fb7e6e" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = false -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-0da1a7f6a9bbc1965" -> null
      - instance_tenancy                 = "default" -> null
      - ipv6_netmask_length              = 0 -> null
      - main_route_table_id              = "rtb-04d935b71a58b78f9" -> null
      - owner_id                         = "438764419550" -> null
      - tags                             = {
          - "Name" = "vpc"
        } -> null
      - tags_all                         = {
          - "Name" = "vpc"
        } -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.autoscaling.aws_autoscaling_attachment.asg_attachment_bar will be created
  + resource "aws_autoscaling_attachment" "asg_attachment_bar" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
      + lb_target_group_arn    = (known after apply)
    }

  # module.autoscaling.aws_autoscaling_group.flugel_autoscaling will be created
  + resource "aws_autoscaling_group" "flugel_autoscaling" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 2
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "Flugel"
        }
      + tag {
          + key                 = "Owner"
          + propagate_at_launch = true
          + value               = "InfraTeam"
        }
      + tag {
          + key                 = "environment"
          + propagate_at_launch = true
          + value               = "autoscaling-production"
        }
    }

  # module.autoscaling.aws_launch_template.nginx_launch will be created
  + resource "aws_launch_template" "nginx_launch" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-04505e74c0741db8d"
      + instance_type          = "t2.micro"
      + key_name               = "jen"
      + latest_version         = (known after apply)
      + name                   = "nginx-production"
      + name_prefix            = (known after apply)
      + tags_all               = (known after apply)
      + user_data              = "TUlNRS1WZXJzaW9uOiAxLjAKQ29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSI9PU1ZQk9VTkRBUlk9PSIKCi0tPT1NWUJPVU5EQVJZPT0KQ29udGVudC1UeXBlOiB0ZXh0L3gtc2hlbGxzY3JpcHQ7IGNoYXJzZXQ9InVzLWFzY2lpIgoKIyEvYmluL2Jhc2gKc3VkbyBta2RpciBodG1sICYmIGNkICRfCiMgY3JlYXRpbmcgYSBzdGF0aWMgZmlsZSB3aXRoIHB5IHNjcmlwdCB0aGF0IHdpbGwgYmUgc2VydmVkIGJ5IG5naW54IGFzIGEgc3RhdGljIGZpbGUKcHl0aG9uMyAtIDw8IEVPRgpmID0gb3BlbignaW5kZXguaHRtbCcsICd3JykKICAKIyB0aGUgaHRtbCBjb2RlIApzdGF0aWNfaHRtbCA9ICIiIgo8IURPQ1RZUEUgaHRtbD4KPGh0bWw+CjxoZWFkPgo8dGl0bGU+VGl0bGU8L3RpdGxlPnoKPC9oZWFkPgo8Ym9keT4KPGgyPldlbGNvbWUgVG8gRmx1Z2VsPC9oMj4KICAKPHA+TmFtZTpGbHVnZWw8L3A+CjxwPk93bmVyOkluZnJhVGVhbTwvcD4KICAKPC9ib2R5Pgo8L2h0bWw+CiIiIgogIAojIHdyaXRpbmcgdGhlIGNvZGUgaW50byB0aGUgZmlsZQpmLndyaXRlKHN0YXRpY19odG1sKQojIGNsb3NlIHRoZSBmaWxlCmYuY2xvc2UoKQoKRU9GCgojIGluc3RhbGxpbmcgZG9ja2VyIApzdWRvIGFwdC1nZXQgdXBkYXRlCnN1ZG8gYXB0LWdldCBpbnN0YWxsIFwKICAgIGNhLWNlcnRpZmljYXRlcyBcCiAgICBjdXJsIFwKICAgIGdudXBnIFwKICAgIGxzYi1yZWxlYXNlCmN1cmwgLWZzU0wgaHR0cHM6Ly9kb3dubG9hZC5kb2NrZXIuY29tL2xpbnV4L3VidW50dS9ncGcgfCBzdWRvIGdwZyAtLWRlYXJtb3IgLW8gL3Vzci9zaGFyZS9rZXlyaW5ncy9kb2NrZXItYXJjaGl2ZS1rZXlyaW5nLmdwZwplY2hvIFwKICAiZGViIFthcmNoPSQoZHBrZyAtLXByaW50LWFyY2hpdGVjdHVyZSkgc2lnbmVkLWJ5PS91c3Ivc2hhcmUva2V5cmluZ3MvZG9ja2VyLWFyY2hpdmUta2V5cmluZy5ncGddIGh0dHBzOi8vZG93bmxvYWQuZG9ja2VyLmNvbS9saW51eC91YnVudHUgXAogICQobHNiX3JlbGVhc2UgLWNzKSBzdGFibGUiIHwgc3VkbyB0ZWUgL2V0Yy9hcHQvc291cmNlcy5saXN0LmQvZG9ja2VyLmxpc3QgPiAvZGV2L251bGwKc3VkbyBhcHQtZ2V0IHVwZGF0ZQpzdWRvIGFwdC1nZXQgaW5zdGFsbCBkb2NrZXItY2UgZG9ja2VyLWNlLWNsaSBjb250YWluZXJkLmlvIC15CgojIHJ1bm5pbmcgZG9ja2VyIGFuZCBtb3VudGluZyBweSBzY3JpcHQgZm9yIG5naW54IHRvIHNlcnZlIGFzIGEgc3RhdGljIGZpbGUKc3VkbyBkb2NrZXIgcnVuIC0tbmFtZSBmbHVnZWwgLXYgL2h0bWw6L3Vzci9zaGFyZS9uZ2lueC9odG1sOnJvICAtZCAtcCA4MDgwOjgwIG5naW54OmxhdGVzdAo0ZWFmNzdlMzAxOWIxNmQzZGM1NGYyZGMxYzc2MzMxZmJiZTZiMDY3NDI2NzY5YzY2NTczYTljMDAxYmQ4MjMyCgotLT09TVlCT1VOREFSWT09LS0="
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }
    }

  # module.loadbalancer.aws_lb.test will be created
  + resource "aws_lb" "test" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "flugel-nginx-alb-production"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Environment" = "alb-production"
        }
      + tags_all                   = {
          + "Environment" = "alb-production"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.loadbalancer.aws_lb_listener.alb-listener-80 will be created
  + resource "aws_lb_listener" "alb-listener-80" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 8080
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.loadbalancer.aws_lb_target_group.instance_target will be created
  + resource "aws_lb_target_group" "instance_target" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "routing-requests-production"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.networking.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "igw-production"
        }
      + tags_all = {
          + "Name" = "igw-production"
        }
      + vpc_id   = (known after apply)
    }

  # module.networking.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "public-production"
        }
      + tags_all         = {
          + "Name" = "public-production"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table_association.public1 will be created
  + resource "aws_route_table_association" "public1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public2 will be created
  + resource "aws_route_table_association" "public2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_s3_bucket.flugel_s3 will be created
  + resource "aws_s3_bucket" "flugel_s3" {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = "bashox1234567890"
      + bucket_domain_name                   = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags                                 = {
          + "Name"  = "Flugel"
          + "Owner" = "InfraTeam"
        }
      + tags_all                             = {
          + "Name"  = "Flugel"
          + "Owner" = "InfraTeam"
        }
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)
          + rule                = (known after apply)
        }
    }

  # module.networking.aws_security_group.allow_8080 will be created
  + resource "aws_security_group" "allow_8080" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic on port 8080"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "allow-8080-production"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "security group instance"
        }
      + tags_all               = {
          + "Name" = "security group instance"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group_rule.allow_inbound_8080 will be created
  + resource "aws_security_group_rule" "allow_inbound_8080" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow port 8080"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.networking.aws_security_group_rule.outgoing will be created
  + resource "aws_security_group_rule" "outgoing" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all outgoing"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.networking.aws_subnet.my_subnet will be created
  + resource "aws_subnet" "my_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "public-us-east-1aproduction"
        }
      + tags_all                                       = {
          + "Name" = "public-us-east-1aproduction"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.my_subnet_b will be created
  + resource "aws_subnet" "my_subnet_b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "public-us-east-1b-production"
        }
      + tags_all                                       = {
          + "Name" = "public-us-east-1b-production"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_vpc.my_vpc will be created
  + resource "aws_vpc" "my_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "vpc-production"
        }
      + tags_all                             = {
          + "Name" = "vpc-production"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns        = (known after apply)
  - instance_tag   = {
      - "Name"  = "Flugel"
      - "Owner" = "InfraTeam"
    } -> null
  + instances_tags = [
      + {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "Flugel"
        },
      + {
          + key                 = "Owner"
          + propagate_at_launch = true
          + value               = "InfraTeam"
        },
      + {
          + key                 = "environment"
          + propagate_at_launch = true
          + value               = "autoscaling-production"
        },
    ]
  - s3_tag         = {
      - "Name"  = "Flugel"
      - "Owner" = "InfraTeam"
    } -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>



*Pusher: @Bash-mocart, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*